In [1]:
import numpy as np

In [3]:
my_list=[10,20,30,40]

In [4]:
type(my_list)

list

In [5]:
np.array(my_list)

array([10, 20, 30, 40])

In [6]:
my_numpy_array = np.array(my_list)

In [7]:
type(my_numpy_array)

numpy.ndarray

In [8]:
my_numpy_array.max()

np.int64(40)

In [9]:
np.ones(5)

array([1., 1., 1., 1., 1.])

In [10]:
#array arithmetic

In [11]:
my_list1 = [1,2]

In [12]:
my_list2=[2,3]

In [13]:
my_list1 + my_list2

[1, 2, 2, 3]

In [14]:
my_numpy_array1 = np.array(my_list1)

In [15]:
my_numpy_array = np.array(my_list2)

In [17]:
my_numpy_array1 + my_numpy_array

array([3, 5])

In [18]:
list(range(0,10))

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9]

In [20]:
np.arange(0,20,2)

array([ 0,  2,  4,  6,  8, 10, 12, 14, 16, 18])

In [22]:
np.random.randn(4)

array([ 0.11847793, -0.19231366, -2.39376661, -0.07155058])

In [23]:
np.random.randn(4,4)

array([[ 1.92150475,  0.41441946,  0.73397623, -0.5681642 ],
       [ 0.89149903, -0.92685772,  0.25542429,  1.03948776],
       [ 1.34027392,  1.00493786,  0.77940415,  0.08725429],
       [ 0.68780662,  0.59095422,  1.0722332 ,  0.31630074]])

In [24]:
np.random.randint(1,300,5)

array([ 84,  97, 127, 213,  98])

In [26]:
# 2-NumpyMatrices

In [27]:
my_matrix = [[5,10],[15,20]]

In [28]:
my_matrix[0][1]

10

In [29]:
# row , column

In [30]:
numpy_matrix = np.array([[5,10],[15,20]])

In [31]:
numpy_matrix

array([[ 5, 10],
       [15, 20]])

In [32]:
my_matrix[0][1]

10

In [33]:
numpy_matrix.sum()

np.int64(50)

In [34]:
np.ones((4,2))

array([[1., 1.],
       [1., 1.],
       [1., 1.],
       [1., 1.]])

In [35]:
# matrix arithmetic

In [37]:
first_array = np.array([[10,20],[30,40]])

In [38]:
second_array = np.array([[5,15],[25,35]])

In [39]:
first_array + second_array

array([[15, 35],
       [55, 75]])

In [40]:
third_array = np.array([[50,60]])

In [41]:
foruth_array = np.array([[10,20,30,40,50]])

In [42]:
first_array + foruth_array

ValueError: operands could not be broadcast together with shapes (2,2) (1,5)

In [43]:
first_array / 4

array([[ 2.5,  5. ],
       [ 7.5, 10. ]])

In [44]:
third_array.shape

(1, 2)

In [45]:
third_array.shape + first_array.shape

(1, 2, 2, 2)

In [46]:
# matrix multiplication

In [47]:
first_array * second_array

array([[  50,  300],
       [ 750, 1400]])

In [48]:
# dot product

In [49]:
first_matrix = np.array ([[10,20,30]])

In [50]:
first_matrix

array([[10, 20, 30]])

In [51]:
first_matrix.shape

(1, 3)

In [52]:
second_matrix = np.array ([[2,3],[2,3],[2,3]])

In [53]:
first_matrix * second_matrix

ValueError: operands could not be broadcast together with shapes (1,3) (3,2)

In [54]:
result_matrix = first_matrix.dot(second_matrix)

In [55]:
result_matrix

array([[120, 180]])

In [1]:
# numpy examples

In [6]:
import numpy as np

In [9]:
array = np.random.randint(1,100,20)

In [10]:
array

array([18, 76, 83, 87, 94, 79, 79, 11, 77, 28, 30, 76, 17, 68, 11, 59, 10,
       84, 20, 44])

In [11]:
array > 25

array([False,  True,  True,  True,  True,  True,  True, False,  True,
        True,  True,  True, False,  True, False,  True, False,  True,
       False,  True])

In [12]:
array[array > 25]

array([76, 83, 87, 94, 79, 79, 77, 28, 30, 76, 68, 59, 84, 44])

In [13]:
array[array <  25]

array([18, 11, 17, 11, 10, 20])

In [14]:
#transpose & reshape

In [15]:
matrix_array = np.array([[10,20],[20,30],[30,40]])

In [16]:
matrix_array

array([[10, 20],
       [20, 30],
       [30, 40]])

In [17]:
matrix_array.transpose()

array([[10, 20, 30],
       [20, 30, 40]])

In [18]:
matrix_array.T

array([[10, 20, 30],
       [20, 30, 40]])

In [19]:
random_array = np.random.random((6,1))

In [20]:
random_array

array([[0.47094228],
       [0.88891826],
       [0.0134823 ],
       [0.57508351],
       [0.35190038],
       [0.11371525]])

In [21]:
random_array.shape

(6, 1)

In [23]:
random_array.reshape(2,3)

array([[0.47094228, 0.88891826, 0.0134823 ],
       [0.57508351, 0.35190038, 0.11371525]])

In [24]:
# z-score

In [85]:
dataa = np.array([10,12,13,15,18,25,100,105])

In [86]:
#outlier

In [88]:
mean = np.mean(dataa)

In [89]:
mean

np.float64(37.25)

In [90]:
dataa.sum() / len(data)

np.float64(37.25)

In [91]:
std = np.std(dataa)

In [92]:
std

np.float64(37.9333296719389)

In [93]:
z_scores = (dataa - mean) / std

In [94]:
z_scores

array([-0.71836562, -0.66564154, -0.6392795 , -0.58655542, -0.50746929,
       -0.322935  ,  1.65421809,  1.78602829])

In [95]:
dataa[z_scores > 1]

array([100, 105])

In [96]:
# math equations

In [97]:
# 2x+3y = 8 and 5x + 7y = 19

In [98]:
#coefficient

In [99]:
A = np.array ([[2,3],[5,7]])

In [100]:
b = np.array([8,19])

In [101]:
solution = np.linalg.solve(A,b)

In [102]:
solution

array([1., 2.])

In [103]:
import pandas as pd

In [46]:
grades = {"Atil": 50, "James": 60, "Lars": 30}

In [47]:
pd.Series(grades)

Atil     50
James    60
Lars     30
dtype: int64

In [49]:
names = ["Atil", "James", "Lars"]
grades = [50, 60, 30]

In [50]:
pd.Series(names)

0     Atil
1    James
2     Lars
dtype: str

In [51]:
pd.Series(names, grades)

50     Atil
60    James
30     Lars
dtype: str

In [52]:
# with numpy

In [53]:
numpy_array = np.array([50,40,30,40])

In [54]:
pd.Series(numpy_array)

0    50
1    40
2    30
3    40
dtype: int64

In [55]:
#arithmetic

In [57]:
contest_result1 = pd.Series(data = [10,5,100], index = ["Atil", "James", "Lars"])

In [61]:
contest_result2 = pd.Series(data = [20,50,10], index=["Atil", "James", "Lars"])

In [62]:
contest_result1["Atil"]

np.int64(10)

In [63]:
final_result = contest_result1 + contest_result2

In [64]:
final_result

Atil      30
James     55
Lars     110
dtype: int64

In [65]:
contest_result1 + contest_result2

Atil      30
James     55
Lars     110
dtype: int64

In [66]:
contest_result1 - contest_result2

Atil    -10
James   -45
Lars     90
dtype: int64

In [67]:
different_series = pd.Series([20,30,40,50],["a","b","c","d"])

In [68]:
different_series

a    20
b    30
c    40
d    50
dtype: int64

In [73]:
different_series2 = pd.Series([10,5,3,1],["a","c","f","g"])

In [74]:
different_series2

a    10
c     5
f     3
g     1
dtype: int64

In [75]:
different_series + different_series2

a    30
c    35
f    43
g    51
dtype: int64

In [76]:
#intro to data frame

In [104]:
data = np.random.randn(4,3)

In [106]:
data

array([[ 1.17709898,  0.90256848,  0.94014673],
       [-0.67352621,  0.81621436, -1.63470481],
       [ 0.15583506,  0.12184725, -1.22351966],
       [-1.30561981,  0.06766363, -0.72725374]])

In [107]:
data_frame = pd.DataFrame(data)

In [108]:
data_frame

          0         1         2
0  1.177099  0.902568  0.940147
1 -0.673526  0.816214 -1.634705
2  0.155835  0.121847 -1.223520
3 -1.305620  0.067664 -0.727254

In [109]:
type(data_frame)

pandas.DataFrame

In [110]:
data_frame[0]

0    1.177099
1   -0.673526
2    0.155835
3   -1.305620
Name: 0, dtype: float64

In [112]:
new_df = pd.DataFrame(data, index = ["Atil", "Zeynep", "Atlas", "Mehmet"], columns = ["Salary", "Age", "Seniorty"])

In [113]:
new_df

          Salary       Age  Seniorty
Atil    1.177099  0.902568  0.940147
Zeynep -0.673526  0.816214 -1.634705
Atlas   0.155835  0.121847 -1.223520
Mehmet -1.305620  0.067664 -0.727254

In [114]:
new_df[["Age","Salary"]]

             Age    Salary
Atil    0.902568  1.177099
Zeynep  0.816214 -0.673526
Atlas   0.121847  0.155835
Mehmet  0.067664 -1.305620

In [115]:
new_df.iloc[:,1]

Atil      0.902568
Zeynep    0.816214
Atlas     0.121847
Mehmet    0.067664
Name: Age, dtype: float64

In [116]:
new_df["Extra"] = 10

In [117]:
new_df

          Salary       Age  Seniorty  Extra
Atil    1.177099  0.902568  0.940147     10
Zeynep -0.673526  0.816214 -1.634705     10
Atlas   0.155835  0.121847 -1.223520     10
Mehmet -1.305620  0.067664 -0.727254     10

In [119]:
new_df.drop("Extra",axis=1) #1 column 0 ise row anlamÄ±na geliyor.

          Salary       Age  Seniorty
Atil    1.177099  0.902568  0.940147
Zeynep -0.673526  0.816214 -1.634705
Atlas   0.155835  0.121847 -1.223520
Mehmet -1.305620  0.067664 -0.727254

In [120]:
new_df

          Salary       Age  Seniorty  Extra
Atil    1.177099  0.902568  0.940147     10
Zeynep -0.673526  0.816214 -1.634705     10
Atlas   0.155835  0.121847 -1.223520     10
Mehmet -1.305620  0.067664 -0.727254     10

In [121]:
new_df.drop("Extra", axis=1, inplace=True)

In [122]:
new_df

          Salary       Age  Seniorty
Atil    1.177099  0.902568  0.940147
Zeynep -0.673526  0.816214 -1.634705
Atlas   0.155835  0.121847 -1.223520
Mehmet -1.305620  0.067664 -0.727254

In [123]:
new_df.loc["Atlas"]["Salary"]

np.float64(0.1558350627439613)

In [128]:
new_df.loc["Atlas","Salary"] = 3.3728738

In [129]:
new_df

          Salary       Age  Seniorty
Atil    1.177099  0.902568  0.940147
Zeynep -0.673526  0.816214 -1.634705
Atlas   3.372874  0.121847 -1.223520
Mehmet -1.305620  0.067664 -0.727254

In [130]:
new_df > 0

        Salary   Age  Seniorty
Atil      True  True      True
Zeynep   False  True     False
Atlas     True  True     False
Mehmet   False  True     False

In [131]:
boolean_frame = new_df > 0

In [132]:
new_df[boolean_frame]

          Salary       Age  Seniorty
Atil    1.177099  0.902568  0.940147
Zeynep       NaN  0.816214       NaN
Atlas   3.372874  0.121847       NaN
Mehmet       NaN  0.067664       NaN

In [133]:
new_df[new_df > 0]

          Salary       Age  Seniorty
Atil    1.177099  0.902568  0.940147
Zeynep       NaN  0.816214       NaN
Atlas   3.372874  0.121847       NaN
Mehmet       NaN  0.067664       NaN

In [135]:
new_df[new_df["Salary"] > 1]

         Salary       Age  Seniorty
Atil   1.177099  0.902568  0.940147
Atlas  3.372874  0.121847 -1.223520

In [136]:
new_df.reset_index()

    index    Salary       Age  Seniorty
0    Atil  1.177099  0.902568  0.940147
1  Zeynep -0.673526  0.816214 -1.634705
2   Atlas  3.372874  0.121847 -1.223520
3  Mehmet -1.305620  0.067664 -0.727254

In [137]:
reset_frame = new_df.reset_index()

In [138]:
new_df.reset_index()

    index    Salary       Age  Seniorty
0    Atil  1.177099  0.902568  0.940147
1  Zeynep -0.673526  0.816214 -1.634705
2   Atlas  3.372874  0.121847 -1.223520
3  Mehmet -1.305620  0.067664 -0.727254

In [139]:
reset_frame

    index    Salary       Age  Seniorty
0    Atil  1.177099  0.902568  0.940147
1  Zeynep -0.673526  0.816214 -1.634705
2   Atlas  3.372874  0.121847 -1.223520
3  Mehmet -1.305620  0.067664 -0.727254

In [141]:
reset_frame.loc[0]

index           Atil
Salary      1.177099
Age         0.902568
Seniorty    0.940147
Name: 0, dtype: object

In [142]:
new_indices = ["Ati", "Zey", "Atl", "Meh"]

In [143]:
new_df["NewIndex"] = new_indices

In [144]:
new_df

          Salary       Age  Seniorty NewIndex
Atil    1.177099  0.902568  0.940147      Ati
Zeynep -0.673526  0.816214 -1.634705      Zey
Atlas   3.372874  0.121847 -1.223520      Atl
Mehmet -1.305620  0.067664 -0.727254      Meh

In [145]:
new_df.set_index("NewIndex", inplace=True)

In [146]:
new_df.loc["Ati"]

Salary      1.177099
Age         0.902568
Seniorty    0.940147
Name: Ati, dtype: float64

In [147]:
#multi index

In [148]:
first_index = ["Simpson","Simpson","Simpson","South Park", "South Park", "South Park"]

In [149]:
inner_index = ["Homer","Bart","Marge","Cartman","Kenny","Kyle"]

In [151]:
zipped_index = list(zip(first_index, inner_index))

In [152]:
zipped_index

[('Simpson', 'Homer'),
 ('Simpson', 'Bart'),
 ('Simpson', 'Marge'),
 ('South Park', 'Cartman'),
 ('South Park', 'Kenny'),
 ('South Park', 'Kyle')]

In [153]:
zipped_index = pd.MultiIndex.from_tuples(zipped_index)

In [154]:
zipped_index

MultiIndex([(   'Simpson',   'Homer'),
            (   'Simpson',    'Bart'),
            (   'Simpson',   'Marge'),
            ('South Park', 'Cartman'),
            ('South Park',   'Kenny'),
            ('South Park',    'Kyle')],
           )

In [157]:
sample_values=np.ones((6,2))

In [158]:
sample_values

array([[1., 1.],
       [1., 1.],
       [1., 1.],
       [1., 1.],
       [1., 1.],
       [1., 1.]])

In [160]:
big_df = pd.DataFrame(sample_values, index=zipped_index, columns = ["Age", "Salary"])

In [161]:
big_df

                    Age  Salary
Simpson    Homer    1.0     1.0
           Bart     1.0     1.0
           Marge    1.0     1.0
South Park Cartman  1.0     1.0
           Kenny    1.0     1.0
           Kyle     1.0     1.0

In [162]:
big_df.loc["Simpson"].loc["Homer"]

Age       1.0
Salary    1.0
Name: Homer, dtype: float64

In [163]:
# pandas real examples